# https://github.com/Homebrew/homebrew-bundle
brew "jpeg-xl"
brew "aom"
brew "asciinema"
brew "autoconf"
brew "docutils"
brew "awscli"
brew "bash"
brew "bat"
brew "glib"
brew "coreutils"
brew "gnutls"
brew "clang-format"
brew "colordiff"
brew "gd"
brew "php"
brew "composer"
brew "direnv"
brew "openjpeg"
brew "ffmpeg"
brew "findutils"
brew "gh"
brew "gnu-sed"
brew "gnuplot"
brew "go"
brew "protobuf"
brew "grpc"
brew "grpcurl"
brew "hub"
brew "imagemagick"
brew "jq"
brew "kubectx"
brew "kustomize"
brew "llvm"
brew "make"
brew "mycli"
brew "mysql-client"
brew "nano"
brew "nkf"
brew "node"
brew "openjdk"
brew "peco"
brew "pyenv"
brew "qemu"
brew "screen"
brew "sox"
brew "stern"
brew "tig"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "yq"
brew "z"
brew "zsh"
brew "gnupg"
# Cask
# https://github.com/Homebrew/homebrew-cask

## cask common
cask "google-cloud-sdk"
cask "visual-studio-code"
cask "iterm2"
cask "goland"
cask "google-japanese-ime"

cask "docker"
cask "karabiner-elements"


## cask for work
#cask "aws-vpn-client"


## cask for private

## cask experimental
cask "emacs"

